# PointCloudColorSettings Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudColorSettings Constructor
PointCloudColorSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PointCloudColorSettings()()()() | Constructs color settings object with default colors. |
| PointCloudColorSettings(PointCloudColorMode) | Constructs color settings object with default color for given color mode. |
| PointCloudColorSettings(PointCloudColorSettings) | Constructs a copy of source object. |
| PointCloudColorSettings(Color, Color) | Constructs color settings object from given colors. |

# See Also
PointCloudColorSettings Class
PointCloudColorSettings Members
Autodesk.Revit.DB.PointClouds Namespace